In [9]:
import pandas as pd

df = pd.read_csv("final_food_delivery_dataset.csv")
df["order_date"] = pd.to_datetime(df["order_date"], dayfirst=True)

In [10]:
df["month"] = df["order_date"].dt.to_period("M")

df.groupby("month").agg(
    total_orders=("order_id","count"),
    total_revenue=("total_amount","sum")
).reset_index()

      month  total_orders  total_revenue
0   2023-01           804      645818.76
1   2023-02           785      630867.40
2   2023-03           903      716738.98
3   2023-04           812      666097.18
4   2023-05           844      668428.61
5   2023-06           784      610822.93
6   2023-07           859      688559.45
7   2023-08           851      694987.58
8   2023-09           812      653838.07
9   2023-10           863      699187.73
10  2023-11           807      637772.43
11  2023-12           849      681303.50
12  2024-01            27       17201.50

In [11]:
df.groupby("user_id").agg(
    total_orders=("order_id","count"),
    total_spent=("total_amount","sum"),
    avg_order_value=("total_amount","mean")
)

         total_orders  total_spent  avg_order_value
user_id
1                   1      1289.66      1289.660000
2                  10      7564.12       756.412000
3                   2      1839.51       919.755000
4                   4      3741.16       935.290000
5                   5      5742.88      1148.576000
...               ...          ...              ...
2996                3      1533.54       511.180000
2997                5      5310.32      1062.064000
2998                6      4241.47       706.911667
2999                1       643.89       643.890000
3000                2      2226.63      1113.315000

[2883 rows x 3 columns]

In [12]:
df.groupby("city").agg(
    total_orders=("order_id","count"),
    total_revenue=("total_amount","sum"),
    avg_order_value=("total_amount","mean")
).sort_values("total_revenue", ascending=False)

           total_orders  total_revenue  avg_order_value
city
Bangalore          2751     2206946.58       802.234308
Chennai            2469     1990513.03       806.202118
Pune               2430     1924797.93       792.097914
Hyderabad          2350     1889366.58       803.985779

In [13]:
df.groupby("cuisine").agg(
    total_orders=("order_id","count"),
    total_revenue=("total_amount","sum"),
    avg_order_value=("total_amount","mean")
).sort_values("total_revenue", ascending=False)

         total_orders  total_revenue  avg_order_value
cuisine
Mexican          2581     2085503.09       808.021344
Italian          2532     2024203.80       799.448578
Indian           2469     1971412.58       798.466011
Chinese          2418     1930504.65       798.389020

In [14]:
df.groupby("membership").agg(
    total_orders=("order_id","count"),
    total_revenue=("total_amount","sum"),
    avg_order_value=("total_amount","mean")
)

            total_orders  total_revenue  avg_order_value
membership
Gold                4987     3975364.89       797.145556
Regular             5013     4036259.23       805.158434

In [16]:
df.groupby("rating")["total_amount"].sum().sort_values(ascending=False)

rating
4.8    657707.71
4.6    495867.97
3.2    490913.01
4.5    479047.03
4.9    467467.09
3.8    466878.69
3.1    443863.92
4.2    423185.06
4.7    416301.51
4.1    380850.85
3.7    368173.17
4.4    346276.90
3.4    339942.79
4.3    330966.42
3.5    318822.05
4.0    318261.42
3.9    299987.19
3.3    288212.80
3.6    264193.94
3.0    255018.13
5.0    159686.47
Name: total_amount, dtype: float64

In [17]:
df.groupby(["city","membership"])["total_amount"].sum()

city       membership
Bangalore  Gold           994702.59
           Regular       1212243.99
Chennai    Gold          1080909.79
           Regular        909603.24
Hyderabad  Gold           896740.19
           Regular        992626.39
Pune       Gold          1003012.32
           Regular        921785.61
Name: total_amount, dtype: float64